Catalogs/Тесты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Тесты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Предметы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьТестирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремешиватьВопросы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОцениватьРезультат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СквозныеОтветы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПеремещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Тесты/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ЭтоГруппа Тогда
	ИначеЕсли Ссылка.Пустая() Тогда
		ПометкаУдаления = Истина;
	ИначеЕсли НЕ Ссылка.ПометкаУдаления Или Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
		ВопросыКоличество = Тесты.ВопросыКоличество(Ссылка);
		Если ВопросыКоличество = 0 Тогда
			//Если Ссылка.ПометкаУдаления И НЕ ПометкаУдаления Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Заполните вопросы", Отказ);
			//ИначеЕсли НЕ Ссылка.ПометкаУдаления Тогда
				//ПометкаУдаления = Истина;
			//КонецЕсли;
		Иначе
			Если ОцениватьРезультат = Ложь И Тесты.ВопросыКоличество(Ссылка, "Оценки") > 0 Тогда
				ОцениватьРезультат = Истина;
			КонецЕсли;
			ОценкиПроверить(Отказ);
			ВопросыПроверить(Отказ);
			ОтветыПроверить(Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЭтоГруппа Тогда
	Иначе
		Если НЕ Ссылка.Пустая() И НЕ Ссылка.ПометкаУдаления Тогда
			//ПроверяемыеРеквизиты.Добавить("Оценки");
			//Если Оценки.Количество() = 0 Тогда
			//	ПометкаУдаления = Истина;
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Предметы") Тогда
		Предмет = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ОценкиПроверить(Отказ)
	Если НЕ Отказ Тогда
		Оценки = Тесты.ОценкиПолучить(Ссылка);
		Гугл = Новый Соответствие;
		Для Каждого тСтрока Из Оценки Цикл
			Если Гугл.Получить(тСтрока.Результат) = Неопределено Тогда
				Гугл.Вставить(тСтрока.Результат);
			КонецЕсли;
		КонецЦикла;
		Если Гугл.Количество() < Оценки.Количество() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Дублируются результаты в оценках теста", ?(ПометкаУдаления, Отказ, ПометкаУдаления));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ВопросыПроверить(Отказ=Ложь)
	Если НЕ Отказ Тогда
		Вопросы = Тесты.ВопросыПоТесту(Ссылка);
		Пока Вопросы.Следующий() Цикл
			Если ?(Вопросы.КоличествоВариантыОтветов = Null, Истина, ?(СквозныеОтветы, Вопросы.КоличествоВариантыОтветов = 0, Вопросы.КоличествоВариантыОтветов < 2)) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не заполнены все варианты ответов", ?(ПометкаУдаления, Отказ, ПометкаУдаления));
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОтветыПроверить(Отказ)
	Если НЕ Отказ Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Вопросы.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.ВариантыОтветов КАК ВариантыОтветов
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Вопросы КАК Вопросы
		                      |		ПО ВариантыОтветов.Владелец = Вопросы.Ссылка
		                      |ГДЕ
		                      |	Вопросы.Владелец = &Ссылка
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Вопросы.Ссылка
		                      |
		                      |ИМЕЮЩИЕ
		                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВариантыОтветов.Ссылка) = 0");
		Запрос.УстановитьПараметр("Ссылка",	Ссылка);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Есть вопросы без вариантов ответов", ?(ПометкаУдаления, Отказ, ПометкаУдаления));
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВариантыОтветов.Владелец КАК Вопрос,
			               |	МАКСИМУМ(ВариантыОтветов.Вес) КАК Вес
			               |ПОМЕСТИТЬ ВесМаксимальный
			               |ИЗ
			               |	Справочник.ВариантыОтветов КАК ВариантыОтветов
			               |ГДЕ
			               |	ВариантыОтветов.Владелец.Владелец = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВариантыОтветов.Владелец
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	СУММА(ВесМаксимальный.Вес) КАК Вес,
			               |	МИНИМУМ(ТестыОценки.Результат) КАК Результат
			               |ИЗ
			               |	Справочник.Оценки КАК ТестыОценки
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесМаксимальный КАК ВесМаксимальный
			               |		ПО (ИСТИНА)
			               |ГДЕ
			               |	ТестыОценки.Владелец = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ТестыОценки.Результат
			               |
			               |ИМЕЮЩИЕ
			               |	СУММА(ВесМаксимальный.Вес) < МИНИМУМ(ТестыОценки.Результат)";
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Слишком большая высшая оценка", ?(ПометкаУдаления, Отказ, ПометкаУдаления));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
